; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Sunsuk Kim <okto79@gmail.com>
; Version/Revision Info: Initial Translation (8/19/2007)
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "확인(&O)"
CANCEL_BUT = "취소(&C)"
MAIN_DEST_DIR_LABEL = "대상 폴더(&D):"
MAIN_FILE_LABEL = "압축해제할 파일/인스톨러(&A):"
MENU_FILE_LABEL = "파일(&F)"
MENU_FILE_QUIT_LABEL = "종료(&Q)"
MENU_EDIT_LABEL = "편집(&E)"
MENU_EDIT_PREFS_LABEL = "설정(&P)"
MENU_HELP_LABEL = "도움말(&H)"
MENU_HELP_WEB_LABEL = "%s 웹사이트(&W)"
PREFS_TITLE_LABEL = "설정"
PREFS_UNIEXTRACT_OPTS_LABEL = "Universal Extractor 옵션"
PREFS_HISTORY_LABEL = "히스토리 저장(&H)"
PREFS_FORMAT_OPTS_LABEL = "Format-Specific Options"
PREFS_LANG_LABEL = "언어(&L)"
PREFS_DEBUG_LABEL = "디버그파일 저장경로(&D):"
PREFS_WARN_EXECUTE_LABEL = "파일 실행 전에 확인(&W)"
PREFS_REMOVE_DUPE_LABEL = "복제된 파일 제거(&R)"
PREFS_REMOVE_TEMP_LABEL = "임시 파일 제거(&T)"
PREFS_APPEND_EXT_LABEL = "파일 확장자 추가(&A)"
METHOD_ADMIN_RADIO = "%s Administrative Installer"
METHOD_EXTRACTION_RADIO = "%s 압축 해제"
METHOD_HEADER = "%s 압축 해제"
METHOD_MSI_NOTE_LABEL = "알림:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml 해제 도구:"
METHOD_MSI_URL_LABEL = "MSXML 4.0 파서"
METHOD_RADIO_LABEL = "압축 해제 방법"
METHOD_SWITCH_RADIO = "%s 변환"
METHOD_NOTIS_RADIO = "InstallShield 인스톨러가 아님"
METHOD_TEXT_LABEL = "%s는 %s꾸러미를 해제하기 위해 다음의 방법들을 지원합니다.  하지만 이러한 방법들의 100% 확실한 동작을 보장할 수 없습니다.  기본 설정된 방법으로 실패할 경우, %s를 재실행하여 다른 방법을 선택해 주세요."
METHOD_UNPACKER_RADIO = "%s 해제기"

; GUI control functions
DOES_NOT_EXIST = "대상이 존재하지 않음.%n"
EXTRACT_TO = "해제 경로"
INVALID_DIR_SELECTED =  "%s은(는) 유효한 폴더가 아닙니다."
INVALID_FILE_SELECTED = "%s유효한 파일을 선택해 주세요."
OPEN_FILE = "파일 열기"
SELECT_FILE = "파일 선택"
WRITE_TO = "저장 폴더"

; Common terms
TERM_ARCHIVE = "archive"
TERM_COMPRESSED = "압축 파일"
TERM_DISK = "디스크"
TERM_EBOOK = "ebook"
TERM_ECARD = "ecard"
TERM_ENCODED = "암호화된 파일"
TERM_EXECUTABLE = "실행 파일"
TERM_FAILED = "실패"
TERM_HELP = "도움말 파일"
TERM_HOTFIX = "핫픽스"
TERM_IMAGE = "이미지"
TERM_INSTALLER = "인스톨러"
TERM_PACKAGE = "꾸러미"
TERM_PATCH = "패치"
TERM_SFX = "자동 풀림"
TERM_STAGE = "단계"
TERM_SUCCEEDED = "성공"
TERM_TESTING = "테스트"
TERM_UNKNOWN = "모름"
TERM_UNPACKED = "unpacked"
TERM_UPDATER = "업데이터"

; Status messages
SCANNING_FILE = "파일형식을 결정하기 위해 스캐닝중"
SCANNING_EXE = "%s 파일 스캐닝"
EXTRACTING = "원본:"
INIT_WAIT = "인스톨러 초기화중%n기다리세요"

; Custom prompts
CONVERT_CDROM = "%s CD-ROM 이미지는 직접 해제가 불가능합니다.  대신,%nISO CD-ROM 이미지로 변환 후 압축해제될 것입니다.%n%n계속 하시겠습니까?%nNote: 이 작업에는 몇 분의 시간이 소요됩니다."
CONVERT_CDROM_STAGE1_FAILED = "오류:  CD-ROM 이미지를 변환할 수 없습니다.%n이 파일이 BIN/CUE 이미지라면, CUE 파일이 올바른지 확인하세요."
CONVERT_CDROM_STAGE2_FAILED = "오류:  ISO 이미지가 %s 이미지로부터 생성되었으나, 변환에 실패했습니다.%n추가적인 분석을 위해 ISO 이미지를 보존하시겠습니까?"
CONVERT_BIN_MISSING = "오류: 대상이 존재하지 않음:%n%s\%s.%s%n%n %s.bin 과 %s.cue 모두 필요합니다."
INIT_COMPLETE = "초기화 %s.  인스톨러를 종료하시고, 계속 하시려면 확인을 눌러주세요."
WISE_MSI_PROMPT = "알림:  이 방법은 일부 Wise 설치 꾸러미에서만 동작합니다.%nWise 설치마법사가 실행중 사용자의 입력을 위해 대기하는 경우에는%n 지원하지 않습니다.  인스톨러를 종료하여 %s 의 해제 과정을 중단할 수 있습니다.%n%n계속 하시겠습니까?"
UNPACK_PROMPT = "이 파일은 %s 압축으로 되어있지만, 해제할 수 없습니다.%n이것은 지원하지 않는 파일 형식이거나, 추출할 파일이%n없기 때문일 수 있습니다.%n%n이 압축을 푸시겠습니까?%n%n알림: 추출된 파일은 다음의 이름을 갖습니다:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "오류:  %s%n를 압축 해제하지 못했습니다."
WARN_EXECUTE = "경고:  이 형식의 압축해제를 위해서는 파일을 직접 실행해야 합니다.%n계속하실 경우, 다음의 명령이 실행됩니다:%n%n%s%n%n이 파일이 악성 프로그램이라고 의심된다면 작업을 중단하시기를 권고합니다.%n계속 하시겠습니까?"

; Help text
HELP_SUMMARY = "모든 형식의 압축 파일과 설치 꾸러미로부터 파일을 추출합니다"
HELP_SYNTAX = "%n용법:  %s [/help] [파일명 [대상 폴더]]"
HELP_ARGUMENTS = "%n%n사용되는 변수:"
HELP_HELP = "%n     /help%t%t도움말 정보 보기"
HELP_FILENAME = "%n     파일명%t압축해제할 파일명"
HELP_DESTINATION = "%n     대상 폴더%t압축 해제할 폴더"
HELP_SUB = "%n%n대상폴더명을 지정하지 않고 /sub 를 사용하면 %n%s 는 압축 파일 이름을 따른 하위폴더에 압축을 해제합니다."
HELP_EXAMPLE1 = "%n%n예:"
HELP_EXAMPLE2 = "%n     %s c:\1\example.zip c:\test"
HELP_NOARGS = "%n%n아무 변수 없이 %s 를 실행하면 사용자에게%n파일명과 대상폴더를 물을 것입니다."

; Error messages
CANNOT_LOG = "%s 압축해제는 기록될 수 없습니다."
CANNOT_DEBUG = "디버그 파일 저장 경로 "%s" 에 기록이 불가능합니다.%n대신 임시 폴더를 사용합니다."
CANNOT_EXTRACT = "%s 를 압축 해제할 수 없습니다.%n반환된 파일 유형: %s%n%n파일을 직접 분석하시려면 확인을, 끝내시려면 취소를 클릭하세요."
UNKNOWN_EXT = "%s%n는 알 수 없는 확장자를 가지고 있기 때문에 압축 해제할 수 없습니다."
INVALID_DIR = "%s%n를 생성할 수 없습니다.  올바른 대상폴더를 선택하세요."
EXTRACT_FAILED = "%s 를 압축 해제할 수 없습니다.%n해당 포맷인 %s는 지원하는 형식이지만, 압축 해제는 실패했습니다.%n자세한 정보를 원하시면 다음 로그파일을 보세요 - %s. %n%n로그 파일을 보시려면 확인을, 끝내시려면 취소를 클릭하세요."

[Installer]
; Components page
COMP_DOCS = "문서 및 라이선스 정보"
COMP_LANG = "다국어 언어팩"
COMP_ACE = "ACE 파일 지원"
COMP_KGB = "KGB 파일 지원"
COMP_PEA = "Pea 파일 지원"
COMP_SIT = "StuffIt 파일 지원"

; Preferences page
PREFS_CAPTION = "프로그램 옵션 설정"
PREFS_DESCRIPTION = "변경하고자 하는 Universal Extractor 의 옵션을 설정하세요"
PREFS_LABEL1 = "Universal Extractor의 기본적인 조작을 결정하기 위한 옵션을 설정할 수 있습니다."
PREFS_LABEL2 = "이 옵션들은 설치 후 UniExtract.ini 파일의 수정을 통해 변경할 수 있습니다."
LANGUAGE_LABEL = "기본 언어"
DEBUG_LABEL = "디버그 파일 위치"
APPEND_EXT_LABEL = "확장자 추가(&A)"
HISTORY_LABEL = "히스토리 보존(&M)"
REMOVE_DUPE_LABEL = "복제된 파일 제거(&D)"
REMOVE_TEMP_LABEL = "임시 파일 제거(&T)"
WARN_EXECUTE_LABEL = "파일 실행 전에 확인(&W)"

; Tasks page
ASSOCIATE = "탐색기 메뉴 통합(&E)"
ASSOCIATE_FILES = "UniExtract로 풀기... 추가(&F)"
ASSOCIATE_HERE = "UniExtract로 여기에 풀기 추가(&H)"
ASSOCIATE_SUBDIR = "UniExtract로 서브폴더에 풀기 추가(&S)"
ASSOCIATE_FORCE = "지원하는 모든 형식과 몽땅 연결(&A)"
MODIFY_PATH = "시스템 PATH에 Universal Extractor 추가(&P)"
DESKTOP_ICON = "바탕 화면에 아이콘 생성(&D)"
QUICK_LAUNCH_ICON = "빠른 실행에 아이콘 생성(&Q)"
SENDTO_ICON = "보내기에 아이콘 생성(&T)"

; Context Menu integration
EXTRACT_FILES = "UniExtract로 풀기(&F)..."
EXTRACT_HERE = "UniExtract로 여기에 풀기(&H)"
EXTRACT_SUB = "UniExtract로 서브폴더에 풀기(&S)"
